---
kind: property
id: P:Autodesk.Revit.DB.FootPrintRoof.CurtainGrids
source: html/4f8a36ba-c169-59c5-54cc-9dfbbd099b82.htm
---
# Autodesk.Revit.DB.FootPrintRoof.CurtainGrids Property

Retrieve all the CurtainGrid objects of a FootPrintRoof.

## Syntax (C#)
```csharp
public CurtainGridSet CurtainGrids { get; }
```

## Remarks
Only applicable when the object is a Curtain FootPrintRoof.